zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_MRU3.h
#define CPE_MRU3_NOTIFY_CH6_IS0_MASK             (0x20U)
#define CPE_MRU3_NOTIFY_CH6_IS0_SHIFT            (5U)
#define CPE_MRU3_NOTIFY_CH6_IS0_WIDTH            (1U)
#define CPE_MRU3_NOTIFY_CH6_IS0(x)               (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_NOTIFY_CH6_IS0_SHIFT)) & CPE_MRU3_NOTIFY_CH6_IS0_MASK)

#define CPE_MRU3_NOTIFY_CH1_IS1_MASK             (0x1U)
#define CPE_MRU3_NOTIFY_CH1_IS1_SHIFT            (0U)
#define CPE_MRU3_NOTIFY_CH1_IS1_WIDTH            (1U)
#define CPE_MRU3_NOTIFY_CH1_IS1(x)               (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_NOTIFY_CH1_IS1_SHIFT)) & CPE_MRU3_NOTIFY_CH1_IS1_MASK)

#define CPE_MRU3_NOTIFY_CH2_IS1_MASK             (0x2U)
#define CPE_MRU3_NOTIFY_CH2_IS1_SHIFT            (1U)
#define CPE_MRU3_NOTIFY_CH2_IS1_WIDTH            (1U)
#define CPE_MRU3_NOTIFY_CH2_IS1(x)               (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_NOTIFY_CH2_IS1_SHIFT)) & CPE_MRU3_NOTIFY_CH2_IS1_MASK)

#define CPE_MRU3_NOTIFY_CH3_IS1_MASK             (0x4U)
#define CPE_MRU3_NOTIFY_CH3_IS1_SHIFT            (2U)
#define CPE_MRU3_NOTIFY_CH3_IS1_WIDTH            (1U)
#define CPE_MRU3_NOTIFY_CH3_IS1(x)               (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_NOTIFY_CH3_IS1_SHIFT)) & CPE_MRU3_NOTIFY_CH3_IS1_MASK)

#define CPE_MRU3_NOTIFY_CH4_IS1_MASK             (0x8U)
#define CPE_MRU3_NOTIFY_CH4_IS1_SHIFT            (3U)
#define CPE_MRU3_NOTIFY_CH4_IS1_WIDTH            (1U)
#define CPE_MRU3_NOTIFY_CH4_IS1(x)               (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_NOTIFY_CH4_IS1_SHIFT)) & CPE_MRU3_NOTIFY_CH4_IS1_MASK)

#define CPE_MRU3_NOTIFY_CH5_IS1_MASK             (0x10U)
#define CPE_MRU3_NOTIFY_CH5_IS1_SHIFT            (4U)
#define CPE_MRU3_NOTIFY_CH5_IS1_WIDTH            (1U)
#define CPE_MRU3_NOTIFY_CH5_IS1(x)               (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_NOTIFY_CH5_IS1_SHIFT)) & CPE_MRU3_NOTIFY_CH5_IS1_MASK)

#define CPE_MRU3_NOTIFY_CH6_IS1_MASK             (0x20U)
#define CPE_MRU3_NOTIFY_CH6_IS1_SHIFT            (5U)
#define CPE_MRU3_NOTIFY_CH6_IS1_WIDTH            (1U)
#define CPE_MRU3_NOTIFY_CH6_IS1(x)               (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_NOTIFY_CH6_IS1_SHIFT)) & CPE_MRU3_NOTIFY_CH6_IS1_MASK)

#define CPE_MRU3_NOTIFY_CH1_IS2_MASK             (0x1U)
#define CPE_MRU3_NOTIFY_CH1_IS2_SHIFT            (0U)
#define CPE_MRU3_NOTIFY_CH1_IS2_WIDTH            (1U)
#define CPE_MRU3_NOTIFY_CH1_IS2(x)               (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_NOTIFY_CH1_IS2_SHIFT)) & CPE_MRU3_NOTIFY_CH1_IS2_MASK)

#define CPE_MRU3_NOTIFY_CH2_IS2_MASK             (0x2U)
#define CPE_MRU3_NOTIFY_CH2_IS2_SHIFT            (1U)
#define CPE_MRU3_NOTIFY_CH2_IS2_WIDTH            (1U)
#define CPE_MRU3_NOTIFY_CH2_IS2(x)               (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_NOTIFY_CH2_IS2_SHIFT)) & CPE_MRU3_NOTIFY_CH2_IS2_MASK)

#define CPE_MRU3_NOTIFY_CH3_IS2_MASK             (0x4U)
#define CPE_MRU3_NOTIFY_CH3_IS2_SHIFT            (2U)
#define CPE_MRU3_NOTIFY_CH3_IS2_WIDTH            (1U)
#define CPE_MRU3_NOTIFY_CH3_IS2(x)               (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_NOTIFY_CH3_IS2_SHIFT)) & CPE_MRU3_NOTIFY_CH3_IS2_MASK)

#define CPE_MRU3_NOTIFY_CH4_IS2_MASK             (0x8U)
#define CPE_MRU3_NOTIFY_CH4_IS2_SHIFT            (3U)
#define CPE_MRU3_NOTIFY_CH4_IS2_WIDTH            (1U)
#define CPE_MRU3_NOTIFY_CH4_IS2(x)               (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_NOTIFY_CH4_IS2_SHIFT)) & CPE_MRU3_NOTIFY_CH4_IS2_MASK)

#define CPE_MRU3_NOTIFY_CH5_IS2_MASK             (0x10U)
#define CPE_MRU3_NOTIFY_CH5_IS2_SHIFT            (4U)
#define CPE_MRU3_NOTIFY_CH5_IS2_WIDTH            (1U)
#define CPE_MRU3_NOTIFY_CH5_IS2(x)               (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_NOTIFY_CH5_IS2_SHIFT)) & CPE_MRU3_NOTIFY_CH5_IS2_MASK)

#define CPE_MRU3_NOTIFY_CH6_IS2_MASK             (0x20U)
#define CPE_MRU3_NOTIFY_CH6_IS2_SHIFT            (5U)
#define CPE_MRU3_NOTIFY_CH6_IS2_WIDTH            (1U)
#define CPE_MRU3_NOTIFY_CH6_IS2(x)               (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_NOTIFY_CH6_IS2_SHIFT)) & CPE_MRU3_NOTIFY_CH6_IS2_MASK)

#define CPE_MRU3_NOTIFY_CH1_IS3_MASK             (0x1U)
#define CPE_MRU3_NOTIFY_CH1_IS3_SHIFT            (0U)
#define CPE_MRU3_NOTIFY_CH1_IS3_WIDTH            (1U)
#define CPE_MRU3_NOTIFY_CH1_IS3(x)               (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_NOTIFY_CH1_IS3_SHIFT)) & CPE_MRU3_NOTIFY_CH1_IS3_MASK)

#define CPE_MRU3_NOTIFY_CH2_IS3_MASK             (0x2U)
#define CPE_MRU3_NOTIFY_CH2_IS3_SHIFT            (1U)
#define CPE_MRU3_NOTIFY_CH2_IS3_WIDTH            (1U)
#define CPE_MRU3_NOTIFY_CH2_IS3(x)               (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_NOTIFY_CH2_IS3_SHIFT)) & CPE_MRU3_NOTIFY_CH2_IS3_MASK)

#define CPE_MRU3_NOTIFY_CH3_IS3_MASK             (0x4U)
#define CPE_MRU3_NOTIFY_CH3_IS3_SHIFT            (2U)
#define CPE_MRU3_NOTIFY_CH3_IS3_WIDTH            (1U)
#define CPE_MRU3_NOTIFY_CH3_IS3(x)               (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_NOTIFY_CH3_IS3_SHIFT)) & CPE_MRU3_NOTIFY_CH3_IS3_MASK)

#define CPE_MRU3_NOTIFY_CH4_IS3_MASK             (0x8U)
#define CPE_MRU3_NOTIFY_CH4_IS3_SHIFT            (3U)
#define CPE_MRU3_NOTIFY_CH4_IS3_WIDTH            (1U)
#define CPE_MRU3_NOTIFY_CH4_IS3(x)               (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_NOTIFY_CH4_IS3_SHIFT)) & CPE_MRU3_NOTIFY_CH4_IS3_MASK)

#define CPE_MRU3_NOTIFY_CH5_IS3_MASK             (0x10U)
#define CPE_MRU3_NOTIFY_CH5_IS3_SHIFT            (4U)
#define CPE_MRU3_NOTIFY_CH5_IS3_WIDTH            (1U)
#define CPE_MRU3_NOTIFY_CH5_IS3(x)               (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_NOTIFY_CH5_IS3_SHIFT)) & CPE_MRU3_NOTIFY_CH5_IS3_MASK)

#define CPE_MRU3_NOTIFY_CH6_IS3_MASK             (0x20U)
#define CPE_MRU3_NOTIFY_CH6_IS3_SHIFT            (5U)
#define CPE_MRU3_NOTIFY_CH6_IS3_WIDTH            (1U)
#define CPE_MRU3_NOTIFY_CH6_IS3(x)               (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_NOTIFY_CH6_IS3_SHIFT)) & CPE_MRU3_NOTIFY_CH6_IS3_MASK)
/*! @} */

/*! @name CH1_MB0 - Channel (x) Mailbox (n) */
/*! @{ */

#define CPE_MRU3_CH1_MB0_MBD_MASK                (0xFFFFFFFFU)
#define CPE_MRU3_CH1_MB0_MBD_SHIFT               (0U)
#define CPE_MRU3_CH1_MB0_MBD_WIDTH               (32U)
#define CPE_MRU3_CH1_MB0_MBD(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_CH1_MB0_MBD_SHIFT)) & CPE_MRU3_CH1_MB0_MBD_MASK)
/*! @} */

