zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_MRU3.h
/*! @name CH1_MB1 - Channel (x) Mailbox (n) */
/*! @{ */

#define CPE_MRU3_CH1_MB1_MBD_MASK                (0xFFFFFFFFU)
#define CPE_MRU3_CH1_MB1_MBD_SHIFT               (0U)
#define CPE_MRU3_CH1_MB1_MBD_WIDTH               (32U)
#define CPE_MRU3_CH1_MB1_MBD(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_CH1_MB1_MBD_SHIFT)) & CPE_MRU3_CH1_MB1_MBD_MASK)
/*! @} */

/*! @name CH1_MB2 - Channel (x) Mailbox (n) */
/*! @{ */

#define CPE_MRU3_CH1_MB2_MBD_MASK                (0xFFFFFFFFU)
#define CPE_MRU3_CH1_MB2_MBD_SHIFT               (0U)
#define CPE_MRU3_CH1_MB2_MBD_WIDTH               (32U)
#define CPE_MRU3_CH1_MB2_MBD(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_CH1_MB2_MBD_SHIFT)) & CPE_MRU3_CH1_MB2_MBD_MASK)
/*! @} */

/*! @name CH1_MB3 - Channel (x) Mailbox (n) */
/*! @{ */

#define CPE_MRU3_CH1_MB3_MBD_MASK                (0xFFFFFFFFU)
#define CPE_MRU3_CH1_MB3_MBD_SHIFT               (0U)
#define CPE_MRU3_CH1_MB3_MBD_WIDTH               (32U)
#define CPE_MRU3_CH1_MB3_MBD(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_CH1_MB3_MBD_SHIFT)) & CPE_MRU3_CH1_MB3_MBD_MASK)
/*! @} */

/*! @name CH2_MB0 - Channel (x) Mailbox (n) */
/*! @{ */

#define CPE_MRU3_CH2_MB0_MBD_MASK                (0xFFFFFFFFU)
#define CPE_MRU3_CH2_MB0_MBD_SHIFT               (0U)
#define CPE_MRU3_CH2_MB0_MBD_WIDTH               (32U)
#define CPE_MRU3_CH2_MB0_MBD(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_CH2_MB0_MBD_SHIFT)) & CPE_MRU3_CH2_MB0_MBD_MASK)
/*! @} */

/*! @name CH2_MB1 - Channel (x) Mailbox (n) */
/*! @{ */

#define CPE_MRU3_CH2_MB1_MBD_MASK                (0xFFFFFFFFU)
#define CPE_MRU3_CH2_MB1_MBD_SHIFT               (0U)
#define CPE_MRU3_CH2_MB1_MBD_WIDTH               (32U)
#define CPE_MRU3_CH2_MB1_MBD(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_CH2_MB1_MBD_SHIFT)) & CPE_MRU3_CH2_MB1_MBD_MASK)
/*! @} */

/*! @name CH2_MB2 - Channel (x) Mailbox (n) */
/*! @{ */

#define CPE_MRU3_CH2_MB2_MBD_MASK                (0xFFFFFFFFU)
#define CPE_MRU3_CH2_MB2_MBD_SHIFT               (0U)
#define CPE_MRU3_CH2_MB2_MBD_WIDTH               (32U)
#define CPE_MRU3_CH2_MB2_MBD(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_CH2_MB2_MBD_SHIFT)) & CPE_MRU3_CH2_MB2_MBD_MASK)
/*! @} */

/*! @name CH2_MB3 - Channel (x) Mailbox (n) */
/*! @{ */

#define CPE_MRU3_CH2_MB3_MBD_MASK                (0xFFFFFFFFU)
#define CPE_MRU3_CH2_MB3_MBD_SHIFT               (0U)
#define CPE_MRU3_CH2_MB3_MBD_WIDTH               (32U)
#define CPE_MRU3_CH2_MB3_MBD(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_CH2_MB3_MBD_SHIFT)) & CPE_MRU3_CH2_MB3_MBD_MASK)
/*! @} */

/*! @name CH3_MB0 - Channel (x) Mailbox (n) */
/*! @{ */

#define CPE_MRU3_CH3_MB0_MBD_MASK                (0xFFFFFFFFU)
#define CPE_MRU3_CH3_MB0_MBD_SHIFT               (0U)
#define CPE_MRU3_CH3_MB0_MBD_WIDTH               (32U)
#define CPE_MRU3_CH3_MB0_MBD(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_CH3_MB0_MBD_SHIFT)) & CPE_MRU3_CH3_MB0_MBD_MASK)
/*! @} */

/*! @name CH3_MB1 - Channel (x) Mailbox (n) */
/*! @{ */

#define CPE_MRU3_CH3_MB1_MBD_MASK                (0xFFFFFFFFU)
#define CPE_MRU3_CH3_MB1_MBD_SHIFT               (0U)
#define CPE_MRU3_CH3_MB1_MBD_WIDTH               (32U)
#define CPE_MRU3_CH3_MB1_MBD(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_CH3_MB1_MBD_SHIFT)) & CPE_MRU3_CH3_MB1_MBD_MASK)
/*! @} */

/*! @name CH3_MB2 - Channel (x) Mailbox (n) */
/*! @{ */

#define CPE_MRU3_CH3_MB2_MBD_MASK                (0xFFFFFFFFU)
#define CPE_MRU3_CH3_MB2_MBD_SHIFT               (0U)
#define CPE_MRU3_CH3_MB2_MBD_WIDTH               (32U)
#define CPE_MRU3_CH3_MB2_MBD(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_CH3_MB2_MBD_SHIFT)) & CPE_MRU3_CH3_MB2_MBD_MASK)
/*! @} */

/*! @name CH3_MB3 - Channel (x) Mailbox (n) */
/*! @{ */

#define CPE_MRU3_CH3_MB3_MBD_MASK                (0xFFFFFFFFU)
#define CPE_MRU3_CH3_MB3_MBD_SHIFT               (0U)
#define CPE_MRU3_CH3_MB3_MBD_WIDTH               (32U)
#define CPE_MRU3_CH3_MB3_MBD(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_CH3_MB3_MBD_SHIFT)) & CPE_MRU3_CH3_MB3_MBD_MASK)
/*! @} */

/*! @name CH4_MB0 - Channel (x) Mailbox (n) */
/*! @{ */

#define CPE_MRU3_CH4_MB0_MBD_MASK                (0xFFFFFFFFU)
#define CPE_MRU3_CH4_MB0_MBD_SHIFT               (0U)
#define CPE_MRU3_CH4_MB0_MBD_WIDTH               (32U)
#define CPE_MRU3_CH4_MB0_MBD(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_CH4_MB0_MBD_SHIFT)) & CPE_MRU3_CH4_MB0_MBD_MASK)
/*! @} */

/*! @name CH4_MB1 - Channel (x) Mailbox (n) */
/*! @{ */

#define CPE_MRU3_CH4_MB1_MBD_MASK                (0xFFFFFFFFU)
#define CPE_MRU3_CH4_MB1_MBD_SHIFT               (0U)
#define CPE_MRU3_CH4_MB1_MBD_WIDTH               (32U)
#define CPE_MRU3_CH4_MB1_MBD(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_CH4_MB1_MBD_SHIFT)) & CPE_MRU3_CH4_MB1_MBD_MASK)
/*! @} */

/*! @name CH4_MB2 - Channel (x) Mailbox (n) */
/*! @{ */

#define CPE_MRU3_CH4_MB2_MBD_MASK                (0xFFFFFFFFU)
#define CPE_MRU3_CH4_MB2_MBD_SHIFT               (0U)
#define CPE_MRU3_CH4_MB2_MBD_WIDTH               (32U)
#define CPE_MRU3_CH4_MB2_MBD(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_CH4_MB2_MBD_SHIFT)) & CPE_MRU3_CH4_MB2_MBD_MASK)
/*! @} */

/*! @name CH4_MB3 - Channel (x) Mailbox (n) */
/*! @{ */

#define CPE_MRU3_CH4_MB3_MBD_MASK                (0xFFFFFFFFU)
#define CPE_MRU3_CH4_MB3_MBD_SHIFT               (0U)
#define CPE_MRU3_CH4_MB3_MBD_WIDTH               (32U)
#define CPE_MRU3_CH4_MB3_MBD(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_CH4_MB3_MBD_SHIFT)) & CPE_MRU3_CH4_MB3_MBD_MASK)
/*! @} */

/*! @name CH5_MB0 - Channel (x) Mailbox (n) */
/*! @{ */

#define CPE_MRU3_CH5_MB0_MBD_MASK                (0xFFFFFFFFU)
#define CPE_MRU3_CH5_MB0_MBD_SHIFT               (0U)
#define CPE_MRU3_CH5_MB0_MBD_WIDTH               (32U)
#define CPE_MRU3_CH5_MB0_MBD(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_MRU3_CH5_MB0_MBD_SHIFT)) & CPE_MRU3_CH5_MB0_MBD_MASK)
/*! @} */

